[
  {
    "title": "Engenharia de Computação",
    "skills": ["C", "Linux", "Gestão de Projetos", "Scrum", "Git", "GitHub", "Arquitetura de Computadores"],
    "description": "Estudante do segundo semestre do curso de Engenharia de Computação, onde adquiro uma base sólida em computação e programação de baixo nível. As aulas práticas e teóricas me preparam para desenvolver soluções de hardware e software, ao mesmo tempo em que aprimoro habilidades de resolução de problemas e otimização de desempenho de sistemas.",
    "subtitle": "Universidade Federal do Pampa | Bagé-RS",
    "date": "ago. 2024 - atualmente"

  },
  {
    "title": "Análise e Desenvolvimento de Sistemas",
    "skills": ["Java", "Modelagem de Dados", "Desenvolvimento de Software"],
    "description": "Formação em Análise e Desenvolvimento de Sistemas, com foco em desenvolvimento backend, modelagem de dados, e design de software. Concluí dois semestres desenvolvendo aplicações que aplicam metodologias ágeis, promovendo a organização e eficiência no ciclo de desenvolvimento de software.",
    "subtitle": "IFSUL | Santana do Livramento-RS",
    "date": "jul. 2023 - jun. 2024"

  },
  {
    "title": "Programa de Residência em TIC ",
    "skills": ["Python", "UI/UX", "Engenharia de Requisitos", "Gestão de Projetos", "Empreendedorismo", "IA", "Banco de Dados"],
    "description": "Progrma residência em TIC fase de Nivelamento em Computação Básica, onde foram abordados conceitos de programação em Python, UI/UX, Engenharia de Requisitos, Gestão de Projetos, Empreendedorismo, IA e Banco de Dados. O programa me proporcionou uma visão ampla e prática de tecnologias e metodologias atuais, preparando-me para atuar em projetos de desenvolvimento de software.",
    "subtitle": "BRISA / Unipampa | Remoto",
    "date": "dez. 2024 - fev. 2025"
  },
  {
    "title": "Cursos de Tecnologia",
    "skills": ["Java", "Angular", "Spring", "PostgreSQL", "TypeScript", "C#", "MongoDB", "AWS", "Linux", "JavaScript", "HTML", "CSS", "UI/UX", "Python", "Gestão Ágil de Projetos"],
    "description": "Em cursos focados no desenvolvimento de habilidades técnicas essenciais e práticas com abordagens voltadas ao mercado, me especializei em Java e Angular para desenvolvimento fullstack. Meu estudo contínuo tem me permitido construir uma base sólida em desenvolvimento back-end, web, bancos de dados relacionais e NoSQL, cloud computing e linguagens modernas, permitindo-me resolver problemas reais com tecnologias de ponta.",
    "subtitle": "Alura | Remoto",
    "date": "jul. 2023 - fev. 2025"
  },
  {
    "title": "Programa DIO Campus Expert",
    "skills": ["Liderança", "Soft Skills", "Networking"],
    "description": "Como embaixador universitário da DIO, desenvolvi habilidades de liderança e comunicação para o compartilhamento de conhecimentos em tecnologia. O programa aprimorou minhas habilidades interpessoais, colaboração e resiliência, fundamentais para criar impacto positivo e atuar como mentor em comunidades acadêmicas de tecnologia.",
    "subtitle": "DIO | Remoto",
    "date": "ago. 2024 - out. 2024"
  }
]
